# POSTTEST 2 - Modul Dataset dan EDA

#### Import library yang diperlukan

In [104]:
import pandas as pd

#### Baca dataset yang telah diunduh dan tampilkan isi dataset

In [105]:
dataFrame = pd.read_csv('imdb_video_game_rating.csv')
dataFrame

,id,title,year,genre,rating,votes,directors,plot
0,0,The Last of Us: Part I,2022,"Action, Adventure, Drama",9.8,601,"Matthew Gallant, Bruce Straley",Experience the emotional storytelling and unfo...
1,1,Red Dead Redemption II,2018,"Action, Adventure, Crime",9.7,36441,Missing,Amidst the decline of the Wild West at the tur...
2,2,The Witcher 3: Wild Hunt - Blood and Wine,2016,"Action, Adventure, Drama",9.7,7610,Konrad Tomaszkiewicz,Geralt is in the southern province of Toussain...
3,3,The Witcher 3: Wild Hunt,2015,"Action, Adventure, Drama",9.7,26328,Konrad Tomaszkiewicz,A monster hunter for hire embarks on an epic j...
4,4,The Last of Us,2013,"Action, Adventure, Drama",9.7,61103,"Neil Druckmann, Bruce Straley","In a hostile, post-pandemic world, Joel and El..."
...,...,...,...,...,...,...,...,...
12630,12633,Superman,1999,"Action, Adventure, Family",1.4,646,Missing,The first 3D Superman game. Your friends Lois ...
12631,12634,Action 52,1991,"Action, Family, Fantasy",1.3,135,"Raul Gomila, Vince Perri",Play the action at your fingertips with 52 gam...
12632,12635,Plumbers Don't Wear Ties,1994,"Comedy, Romance",1.3,338,Michael Anderson,"John, an unattached plumber, meets and falls i..."
12633,12636,Animal Soccer World,2005,"Animation, Sport",1.2,125,Roswitha Haas,Everybody is busy with the preparations for th...
12634,12637,CrazyBus,2004,"Adventure, Family",1.0,126,Tom Maneiro,You get to select your bus and drive it across...

#### Tampilkan informasi seputar properties dari dataset

In [106]:
dataFrame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12635 entries, 0 to 12634
Data columns (total 8 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   id         12635 non-null  int64
 1   title      12635 non-null  object
 2   year       12635 non-null  int64
 3   genre      12635 non-null  object
 4   rating     12635 non-null  float64
 5   votes      12635 non-null  int64
 6   directors  12635 non-null  object
 7   plot       12635 non-null  object
dtypes: float64(1), int64(3), object(4)
memory usage: 789.8+ KB

#### Buat variabel untuk menampung nilai:
* Jumlah record
* Nama atribut
* Jumlah atribut dengan tipe data objek
* Jumlah atribut dengan tipe data angka
* Jumlah atribut dengan nilai null

In [107]:
jumlahRecord = len(dataFrame)                                                    # Variabel Penampung Nilai Jumlah Record
namaAtribut = dataFrame.columns.to_list()                                        # Variabel Penampung Nilai Nama Atribut
atributObjek = len(dataFrame.select_dtypes(include=['object']).columns)          # Variabel Penampung Nilai Atribut Bertipe data objek
atributAngka = len(dataFrame.select_dtypes(include=['int64','float64']).columns) # Variabel Penampung Nilai Atribut Bertipe data angka
atributNilaiNull = len(dataFrame.columns[dataFrame.isna().sum() > 0])            # Variabel Penampung Nilai Atribut Null

#### Masukkan nilai variabel di atas ke dalam dictionary dan tampilkan isi dari dictionary tersebut

In [108]:
dictionaryDataframe = {
    "Jumlah Record": jumlahRecord,
    "Nama Atribut": namaAtribut,
    "Jumlah Atribut Objek": atributObjek,
    "Jumlah Atribut Angka": atributAngka,
    "Jumlah Atribut Nilai Null": atributNilaiNull,
}
print("Berikut adalah isi dari dictionary tersebut.")
for i in range(len(dictionaryDataframe)):
    for key, value in dictionaryDataframe.items():
        i+=1
        if key == "Nama Atribut":
            print("%i. %s:" % (i, key))
            for j in range(len(dictionaryDataframe['Nama Atribut'])):
                for k in dictionaryDataframe['Nama Atribut']:
                    j+=1
                    print("   %i. %s" % (j, k))
                break
        else:
            print("%i. %s:" % (i, key), value)
    break

Berikut adalah isi dari dictionary tersebut.
1. Jumlah Record: 12635
2. Nama Atribut:
   1. id
   2. title
   3. year
   4. genre
   5. rating
   6. votes
   7. directors
   8. plot
3. Jumlah Atribut Objek: 4
4. Jumlah Atribut Angka: 4
5. Jumlah Atribut Nilai Null: 0

#### Tampilkan nilai di bawah ini dengan syarat atribut hanya bertipe data angka: 
* Mean
* Standar deviasi
* Minimum
* Maksimum
* Quartil 1 (25%)
* Quartil 2 (50%)
* Quartil 3 (75%)

In [109]:
dataFrame.describe().loc[["mean", "std", "min", "max", "25%", "50%", "75%"]]

                id         year    rating         votes
mean   6317.319747  2004.555837  6.945105    383.722438
std    3648.018413    10.849698  1.254719   1802.919253
min       0.000000  1948.000000  1.000000      5.000000
max   12637.000000  2022.000000  9.800000  61103.000000
25%    3158.500000  1997.000000  6.300000     15.000000
50%    6317.000000  2005.000000  7.200000     38.000000
75%    9475.500000  2014.000000  7.800000    137.000000

#### Tampilkan nilai korelasi dengan syarat atribut hanya bertipe data angka

In [110]:
dataFrame.corr(numeric_only=True)

              id      year    rating     votes
id      1.000000 -0.162981 -0.932981 -0.221570
year   -0.162981  1.000000  0.152910  0.072981
rating -0.932981  0.152910  1.000000  0.211990
votes  -0.221570  0.072981  0.211990  1.000000

#### Ubah salah satu atribut bertipe data angka menjadi desimal dengan 3 angka di belakang koma

In [111]:
dataFrame["votes"] * 0.001

0         0.601
1        36.441
2         7.610
3        26.328
4        61.103
          ...
12630     0.646
12631     0.135
12632     0.338
12633     0.125
12634     0.126
Name: votes, Length: 12635, dtype: float64

#### Ubah salah satu atribut bertipe data desimal menjadi angka

In [112]:
dataFrame["rating"].round().astype('int64')

0        10
1        10
2        10
3        10
4        10
         ..
12630     1
12631     1
12632     1
12633     1
12634     1
Name: rating, Length: 12635, dtype: int64

#### Tampilkan 10 record pertama dari dataset dengan syarat atribut hanya bertipe data angka

In [113]:
dataframeAngka = dataFrame.select_dtypes(include=["int64","float64"])
dataframeAngka.head(10)

   id  year  rating  votes
0   0  2022     9.8    601
1   1  2018     9.7  36441
2   2  2016     9.7   7610
3   3  2015     9.7  26328
4   4  2013     9.7  61103
5   5  2021     9.7   1628
6   6  2018     9.6  26507
7   7  2019     9.6   1214
8   8  1998     9.6   9576
9   9  1998     9.6  11809

#### Simpan dataset menjadi dataset baru dengan syarat atribut hanya bertipe data angka

In [114]:
dataframeAngka.to_csv('imdb_video_game_rating_numeric_only.csv')